app/controllers/movies_controller.rb

  def index
    @movies = params[:sort] == "title" || params[:sort] == "release_date" ? Movie.order(params[:sort]) : Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY release_date